evilpete/ESP32Marauder/esp32_marauder/configs.h
  #ifdef MARAUDER_V7_1
    //#define FLIPPER_ZERO_HAT
    #define HAS_MINI_KB
    #define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_PSRAM
    //#define HAS_NIMBLE_2
    #define HAS_DIRECT_UPLOAD
  #endif


  #if defined(MARAUDER_REV_FEATHER) || defined(MARAUDER_REV_FEATHER_S3)
    //#define FLIPPER_ZERO_HAT
    #ifdef MARAUDER_REV_FEATHER_S3
      #define MARAUDER_REV_FEATHER
      #define HAS_BT
        #define HAS_NIMBLE_2
      #define HAS_IDF_3
    #endif   // REV_FEATHER S3
    #define HAS_SD              // Adalogger
      #define USE_SD
    #define HAS_RTC
      #define HAS_PCF8523         // i2c real-time clock (RTC) in Adalogger
    #define HAS_BATTERY
      #define HAS_MAX1704X
    #define HAS_PSRAM
    #define HAS_MINI_KB
    #define HAS_BUTTONS
    #define HAS_LED
      #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
      #define HAS_MINI_SCREEN
    #define HAS_GPS
  #endif   // MARAUDER_REV_FEATHER


  #ifdef MARAUDER_V4
    #define HAS_TOUCH
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
      #define HAS_IP5306
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_C5_SD
    #define HAS_DIRECT_UPLOAD
  #endif

  #if defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
    #define HAS_TOUCH
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
      #define HAS_IP5306
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_C5_SD
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_CYD_MICRO
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_CYD_TOUCH
    //#define HAS_NIMBLE_2
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_CYD_2USB
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_CYD_TOUCH
    #define HAS_CYD_PORTRAIT
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_CYD_3_5_INCH
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    //#define HAS_CYD_TOUCH
    #define HAS_SEPARATE_SD
    #define HAS_CYD_PORTRAIT
    //#define HAS_NIMBLE_2
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_CYD_GUITION
    #define HAS_TOUCH
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    //#define HAS_CYD_TOUCH
    //#define HAS_NIMBLE_2
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_KIT
    #define HAS_TOUCH
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_SD
    #define USE_SD
    #define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_C5_SD
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef GENERIC_ESP32
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
    //#define HAS_NIMBLE_2
  #endif

  #ifdef MARAUDER_FLIPPER
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    //#define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_GPS
    #define HAS_SD
    #define USE_SD
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_MULTIBOARD_S3
    #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_GPS
    #define HAS_SD
    #define USE_SD
    //#define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef ESP32_LDDB
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_SD
    #define USE_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    //#define HAS_DIRECT_UPLOAD
  #endif

