evilpete/ESP32Marauder/esp32_marauder/configs.h
  #ifdef MARAUDER_DEV_BOARD_PRO
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_SD
    #define USE_SD
    //#define HAS_TEMP_SENSOR
    #define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef XIAO_ESP32_S3
    #define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_LED
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
  #endif


  #ifdef MARAUDER_CYD_HMI
    #define HAS_TEMP_SENSOR
      #define USE_CPU_TEMP
    #define HAS_BT
      #define HAS_NIMBLE_2
    #define HAS_BATTERY
      #define BATTERY_ADC_PIN 5
    #define HAS_BUTTONS
    #define HAS_SCREEN
      #define HAS_FULL_SCREEN
      #define BK_LIGHT_PIN 38
      #define TFT_BL 38
      #define HAS_AW9364        // Backlight controller
    #define HAS_SDMMC
      #define HAS_SD
      #define USE_SD
    #define HAS_TOUCH
      #define HAS_CYD_TOUCH
      #define HAS_XPT2046
    #define HAS_PSRAM
    /// #define HAS_GPS
    /// #define HAS_GPSI2C
    ///   #define I2C_SDA 17   // Grove 2
    ///   #define I2C_SCL 18
    ///   #define HAS_GPSI2C_ADDR 0x20

    #define HAS_CYD_PORTRAIT
    #define HAS_IDF_3
    #define HAS_PWR_MGMT
      #define PWR_EN_PIN  10
      #define PWR_ON_PIN  14
  #endif

    /*
    #ifdef ESP_ARDUINO_VERSION
      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        #define HAS_IDF_3
      #endif
    #endif
    */

  #ifdef MARAUDER_C5
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    #define HAS_GPS
    // #define HAS_C5_SD     // No Display
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    //#define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_T_DONGLE_C5
    #define HAS_BT
    #define HAS_T_DONGLE_DISPLAY
    #define HAS_T_DONGLE_LED
    #define T_DONGLE_LED_DATA_PIN 2
    #define T_DONGLE_LED_CLOCK_PIN 6
    #define T_DONGLE_TFT_CS_PIN 10
    #define T_DONGLE_SPI_SCLK_PIN 6
    #define T_DONGLE_SPI_MISO_PIN 7
    #define T_DONGLE_SPI_MOSI_PIN 2
    #define HAS_GPS
    // #define HAS_C5_SD  // No Display
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    #define HAS_PSRAM
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_V8
    #define HAS_TOUCH
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_GPS
    #define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_ACT_LED
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_PANCAKE
    #define HAS_TOUCH
    #define HAS_CAP_TOUCH
      #define HAS_FT6336
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    #define HAS_BATTERY
    #define HAS_BT
    #define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_SCREEN
    #define HAS_FULL_SCREEN
    #define HAS_GPS
    #define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    #define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_MINI_V3
    //#define HAS_TOUCH
    //#define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    //#define HAS_BATTERY
    #define HAS_BT
    #define HAS_BUTTONS
    //#define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    #define HAS_MINI_KB
    #define HAS_SCREEN
    #define HAS_MINI_SCREEN
    #define HAS_GPS
    #define HAS_C5_SD
    #define HAS_SD
    #define USE_SD
    #define HAS_DUAL_BAND
    #define HAS_PSRAM
    //#define HAS_TEMP_SENSOR
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    //#define HAS_SIMPLEX_DISPLAY
    #define HAS_DIRECT_UPLOAD
  #endif

  #if defined(MARAUDER_M5_NANO_C6)
    //#define FLIPPER_ZERO_HAT
    //#define HAS_MINI_KB
    //#define HAS_BATTERY
    #define HAS_BT
    //#define HAS_BUTTONS
    #define HAS_NEOPIXEL_LED
    //#define HAS_PWR_MGMT
    //#define HAS_SCREEN
    //#define HAS_MINI_SCREEN
    //#define HAS_SD
    //#define USE_SD
    //#define HAS_TEMP_SENSOR
    //#define HAS_GPS
    #define HAS_NIMBLE_2
    #define HAS_IDF_3
    //#define HAS_DIRECT_UPLOAD
  #endif

  #ifdef MARAUDER_JC2432W328C
    #define HAS_TOUCH
      #define HAS_CAP_TOUCH
      #define HAS_CST820      // i2c self-capacitive touch controller
    #define HAS_LED
      #define HAS_FLIPPER_LED
    //#define FLIPPER_ZERO_HAT
    #define HAS_BT
      #define HAS_NIMBLE_2
    #define HAS_IDF_3
    // #define HAS_BT_REMOTE
    #define HAS_BUTTONS
    #define HAS_SCREEN
      #define HAS_FULL_SCREEN
    #define HAS_SD
      #define USE_SD
    // #define HAS_GPS
    // #define HAS_CYD_PORTRAIT
  #endif  // MARAUDER_JC2432W328C

  #ifdef MARAUDER_CYD_HMI
    #define HAS_TOUCH
    #define HAS_BT
    #define HAS_BATTERY
      #define BATTERY_ADC_PIN 5
     #define HAS_RTC
      // #define HAS_PCF8523         // i2c real-time clock (RTC)
     #define HAS_DS1307         // i2c real-time clock (RTC)
    #define HAS_BUTTONS
    #define HAS_SCREEN
      #define HAS_FULL_SCREEN
    #define HAS_SDMMC
      #define HAS_SD
      #define USE_SD
    // #define MSC_SHARE
    //   #define USE_MMC_WRITE_SECTORS
    #define HAS_CYD_TOUCH
    #define ADJ_CPUFREQ
    #define HAS_PSRAM
    #define HAS_AW9364   //  1-wire Dimming LED Driver 
    #define TFT_BL 38
    // #define BK_LIGHT_PIN 38
    // #define HAS_GPS
    #define HAS_CYD_PORTRAIT
    #define HAS_NIMBLE_2
    //#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      #define HAS_IDF_3
    //#endif
    #define HAS_PWR_MGMT
      #define PWR_EN_PIN  10     // Powers peripherals
      #define PWR_ON_PIN  14     // Latches battery power on
   #endif

  #ifdef MARAUDER_CYD_24
    #define HAS_TOUCH
    #define HAS_LED
      #define HAS_FLIPPER_LED
    #define HAS_BT
      #define HAS_NIMBLE_2
    #define HAS_BUTTONS
    #define HAS_SCREEN
      #define HAS_FULL_SCREEN
    #define HAS_SD
      #define USE_SD
    #define HAS_GPS
    #define HAS_CYD_PORTRAIT
    #define HAS_IDF_3
  #endif

      #if defined(MARAUDER_M5_NANO_C6)
        //#define FLIPPER_ZERO_HAT
        //#define HAS_MINI_KB
        //#define HAS_BATTERY
        #define HAS_BT
        //#define HAS_BUTTONS
        #define HAS_NEOPIXEL_LED
        //#define HAS_PWR_MGMT
        //#define HAS_SCREEN
        //#define HAS_MINI_SCREEN
        //#define HAS_SD
        //#define USE_SD
        //#define HAS_TEMP_SENSOR
        //#define HAS_GPS
        #define HAS_NIMBLE_2
        #define HAS_IDF_3
        //#define HAS_DIRECT_UPLOAD
      #endif


