evilpete/ESP32Marauder/esp32_marauder/configs.h
      // Waveshare ESP32-C5-Touch-LCD-2.8
      // ESP32-C5, ST7789 240x320, CST3530 capacitive touch, CH32V003 IO expander
      // 32MB flash, 8MB PSRAM, dual-band WiFi, BLE5, SD card, audio

      // I2C bus (shared by touch CST3530, CH32V003, QMI8658, SHTC3, PCF85063A)
    #if defined(MARAUDER_WS_C5_28)
      #define HAS_TOUCH
        #define HAS_CAP_TOUCH
        #define HAS_CST3530 1      // distinguish from CST820
      #define HAS_BT
        #define HAS_NIMBLE_2
      #define HAS_BUTTONS
      #define HAS_SCREEN
        #define HAS_FULL_SCREEN
        #define TFT_WIDTH         240
        #define TFT_HEIGHT        320
        #define PORTRAIT
        #define HAS_ILI9341
      #define HAS_SD
        #define USE_SD
        #define HAS_C5_SD

      #define I2C_SDA           0
      #define I2C_SCL           1
      #define HAS_CH32V003         // CH32V003 IO expander
        #define CH32V003_I2C_ADDR 0x24
      #define HAS_TEMP_SENSOR
        #define HAS_SHTC3
      // Platform capabilities
      #define HAS_PSRAM
        #define BOARD_HAS_PSRAM
      #define HAS_DUAL_BAND     // C5 dual-band WiFi
      #define HAS_BATTERY    // ADC is through IO expander
          #define BATTERY_ADC_PIN 0x06    // CH32V003 Reg Id
      #define HAS_RTC
        #define HAS_PCF85063         // i2c real-time clock (RTC)

      // #define HAS_GPS
      #define HAS_GPSI2C
      // #define HAS_CYD_PORTRAIT
      #define HAS_IDF_3
      // HAS_MIC
      #define DEEPSLEEP
    #endif     // MARAUDER_WS_C5_28

  //// END BOARD FEATURES

    #ifndef GMTOFFSET_SEC
      #define GMTOFFSET_SEC 0  // -8 hours for Pacific Time
    #endif

    #ifndef DAYLIGHTOFFSET_SEC
      #define DAYLIGHTOFFSET_SEC 0
    #endif


  //// POWER MANAGEMENT
  #ifdef HAS_PWR_MGMT
    #if defined(HAS_AXP192)
      #include "AXP192.h"
    #endif

    #ifdef MARAUDER_M5STICKCP2
      // Prevent StickCP2 from turning off when disconnect USB cable
      #define POWER_HOLD_PIN 4

    #elif defined(MARAUDER_CYD_HMI)
      #define PWR_EN_PIN  10    // power to peripherals
      #define PWR_ON_PIN  14    // Batt power to board
      #define POWER_HOLD_PIN PWR_ON_PIN
    #endif

  #endif
  //// END POWER MANAGEMENT

  //// BUTTON DEFINITIONS
  #ifdef HAS_BUTTONS

    #ifdef MARAUDER_REV_FEATHER
      #define L_BTN -1
      #define C_BTN 1
      #define U_BTN 0
      #define R_BTN -1
      #define D_BTN 2

      //#define HAS_L
      //#define HAS_R
      #define HAS_U
      #define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL false
      #define U_PULL true
      #define R_PULL true
      #define D_PULL false
    #endif

    #ifdef MARAUDER_MINI
      #define L_BTN 13
      #define C_BTN 34
      #define U_BTN 36
      #define R_BTN 39
      #define D_BTN 35

      #define HAS_L
      #define HAS_R
      #define HAS_U
      #define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #ifdef MARAUDER_V7
      #define L_BTN 13
      #define C_BTN 34
      #define U_BTN 36
      #define R_BTN 39
      #define D_BTN 35

      #define HAS_L
      #define HAS_R
      #define HAS_U
      #define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #ifdef MARAUDER_V7_1
      #define L_BTN 13
      #define C_BTN 34
      #define U_BTN 36
      #define R_BTN 39
      #define D_BTN 35

      #define HAS_L
      #define HAS_R
      #define HAS_U
      #define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #if defined(MARAUDER_M5STICKC) || defined(MARAUDER_M5STICKCP2)
      #define L_BTN -1
      #define C_BTN 37
      #if defined(MARAUDER_M5STICKCP2)
        #define U_BTN 35
      #else
        #define U_BTN -1
      #endif
      #define R_BTN -1
      #define D_BTN 39

      //#define HAS_L
      //#define HAS_R
      #if defined(MARAUDER_M5STICKCP2)
        #define HAS_U
      #endif
      #define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #if defined(MARAUDER_CARDPUTER) || defined(MARAUDER_CARDPUTER_ADV)
      #define L_BTN -1
      #define C_BTN 0
      #define U_BTN -1
      #define R_BTN -1
      #define D_BTN -1

      //#define HAS_L
      //#define HAS_R
      //#define HAS_U
      //#define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #ifdef MARAUDER_V6
      #define L_BTN -1
      #define C_BTN 0
      #define U_BTN -1
      #define R_BTN -1
      #define D_BTN -1

      //#define HAS_L
      //#define HAS_R
      //#define HAS_U
      //#define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #ifdef MARAUDER_V6_1
      #define L_BTN -1
      #define C_BTN 0
      #define U_BTN -1
      #define R_BTN -1
      #define D_BTN -1

      //#define HAS_L
      //#define HAS_R
      //#define HAS_U
      //#define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #ifdef MARAUDER_PANCAKE
      #define L_BTN -1
      #define C_BTN 28
      #define U_BTN -1
      #define R_BTN -1
      #define D_BTN -1

      //#define HAS_L
      //#define HAS_R
      //#define HAS_U
      //#define HAS_D
      #define HAS_C

      #define L_PULL true
      #define C_PULL true
      #define U_PULL true
      #define R_PULL true
      #define D_PULL true
    #endif

    #ifdef MARAUDER_CYD_MICRO
      #define L_BTN -1
      #define C_BTN 0
      #define U_BTN -1
      #define R_BTN -1
      #define D_BTN -1

