evilpete/ESP32Marauder/esp32_marauder/configs.h
      #define GRAPH_VERT_LIM TFT_HEIGHT/2 - 1

      #define EXT_BUTTON_WIDTH 30

      #define SCREEN_BUFFER

      #define MAX_SCREEN_BUFFER 21

      #define SCREEN_ORIENTATION 0

      #define CHAR_WIDTH 12
      #define SCREEN_WIDTH TFT_WIDTH
      #define SCREEN_HEIGHT TFT_HEIGHT
      #define HEIGHT_1 TFT_WIDTH
      #define WIDTH_1 TFT_HEIGHT
      #define STANDARD_FONT_CHAR_LIMIT (TFT_WIDTH/6) // number of characters on a single line with normal font
      #define TEXT_HEIGHT 16 // Height of text to be printed and scrolled
      #define BOT_FIXED_AREA 0 // Number of lines in bottom fixed area (lines counted from bottom of screen)
      #define TOP_FIXED_AREA 48 // Number of lines in top fixed area (lines counted from top of screen)
      #define YMAX 320 // Bottom of screen area
      #define minimum(a,b)     (((a) < (b)) ? (a) : (b))
      //#define MENU_FONT NULL
      #define MENU_FONT &FreeMono9pt7b // Winner
      //#define MENU_FONT &FreeMonoBold9pt7b
      //#define MENU_FONT &FreeSans9pt7b
      //#define MENU_FONT &FreeSansBold9pt7b
      #define BUTTON_SCREEN_LIMIT 12
      #define BUTTON_ARRAY_LEN BUTTON_SCREEN_LIMIT
      #define STATUS_BAR_WIDTH 16
      #define LVGL_TICK_PERIOD 6

      #define FRAME_X 100
      #define FRAME_Y 64
      #define FRAME_W 120
      #define FRAME_H 50

      // Red zone size
      #define REDBUTTON_X FRAME_X
      #define REDBUTTON_Y FRAME_Y
      #define REDBUTTON_W (FRAME_W/2)
      #define REDBUTTON_H FRAME_H

      // Green zone size
      #define GREENBUTTON_X (REDBUTTON_X + REDBUTTON_W)
      #define GREENBUTTON_Y FRAME_Y
      #define GREENBUTTON_W (FRAME_W/2)
      #define GREENBUTTON_H FRAME_H
    
      #define STATUSBAR_COLOR 0x4A49
    
      #define KIT_LED_BUILTIN 13
    #endif   // MARAUDER_JC2432W328C

   #if defined(MARAUDER_CYD_HMI)
       #define CHAN_PER_PAGE 7
       #define SCREEN_CHAR_WIDTH 40
      #define HAS_ILI9341
       #define HAS_ST7789

      #define TFT_BL 38
      #define BANNER_TEXT_SIZE 2

      // #define I2C_SDA 33
      // #define I2C_SCL 32

      #if defined(HAS_RTC) && !defined(RTC_SDA)
        #define RTC_SDA 17
        #define RTC_SCL 18
      #endif

      #ifndef TFT_WIDTH
        #define TFT_WIDTH 240
      #endif

      #ifndef TFT_HEIGHT
        #define TFT_HEIGHT 320
      #endif

      #define GRAPH_VERT_LIM TFT_HEIGHT/2 - 1
      #define EXT_BUTTON_WIDTH 30
      #define SCREEN_BUFFER
      #define MAX_SCREEN_BUFFER 21

      #define SCREEN_ORIENTATION 0
      #define CHAR_WIDTH 12
      #define SCREEN_WIDTH TFT_WIDTH
      #define SCREEN_HEIGHT TFT_HEIGHT
      #define HEIGHT_1 TFT_WIDTH
      #define WIDTH_1 TFT_HEIGHT
      #define STANDARD_FONT_CHAR_LIMIT (TFT_WIDTH/6) // number of characters on a single line with normal font
      #define TEXT_HEIGHT 16 // Height of text to be printed and scrolled
      #define BOT_FIXED_AREA 0 // Number of lines in bottom fixed area (lines counted from bottom of screen)
      #define TOP_FIXED_AREA 48 // Number of lines in top fixed area (lines counted from top of screen)
      #define YMAX 320 // Bottom of screen area
      #define minimum(a,b)     (((a) < (b)) ? (a) : (b))
      #define MENU_FONT &FreeMono9pt7b // Winner
      //#define MENU_FONT &FreeMonoBold9pt7b
      //#define MENU_FONT &FreeSans9pt7b
      //#define MENU_FONT &FreeSansBold9pt7b
      #define BUTTON_SCREEN_LIMIT 12
      #define BUTTON_ARRAY_LEN BUTTON_SCREEN_LIMIT
      #define STATUS_BAR_WIDTH 16
      #define LVGL_TICK_PERIOD 6

      #define FRAME_X 100
      #define FRAME_Y 64
      #define FRAME_W 120
      #define FRAME_H 50

      // Red zone size
      #define REDBUTTON_X FRAME_X
      #define REDBUTTON_Y FRAME_Y
      #define REDBUTTON_W (FRAME_W/2)
      #define REDBUTTON_H FRAME_H

      // Green zone size
      #define GREENBUTTON_X (REDBUTTON_X + REDBUTTON_W)
      #define GREENBUTTON_Y FRAME_Y
      #define GREENBUTTON_W (FRAME_W/2)
      #define GREENBUTTON_H FRAME_H
      #define STATUSBAR_COLOR 0x4A49
    #endif  // MARAUDER_CYD_HMI

    #if defined(MARAUDER_CYD_24)
      #define CHAN_PER_PAGE 7
      #define SCREEN_CHAR_WIDTH 40
      #define HAS_ILI9341
      #define HAS_ST7789

      // CN1
      #if defined(HAS_RTC) && !defined(RTC_SDA)
        #define RTC_SDA 21
        #define RTC_SCL 22
      #endif

      #define TFT_BL 27
      #define BANNER_TEXT_SIZE 2

      #ifndef TFT_WIDTH
        #define TFT_WIDTH 240
      #endif

      #ifndef TFT_HEIGHT
        #define TFT_HEIGHT 320
      #endif

      #define GRAPH_VERT_LIM TFT_HEIGHT/2 - 1
      #define EXT_BUTTON_WIDTH 30
      #define SCREEN_BUFFER
      #define MAX_SCREEN_BUFFER 21

      #define SCREEN_ORIENTATION 0
    
      #define CHAR_WIDTH 12
      #define SCREEN_WIDTH TFT_WIDTH
      #define SCREEN_HEIGHT TFT_HEIGHT
      #define HEIGHT_1 TFT_WIDTH
      #define WIDTH_1 TFT_HEIGHT
      #define STANDARD_FONT_CHAR_LIMIT (TFT_WIDTH/6) // number of characters on a single line with normal font
      #define TEXT_HEIGHT 16 // Height of text to be printed and scrolled
      #define BOT_FIXED_AREA 0 // Number of lines in bottom fixed area (lines counted from bottom of screen)
      #define TOP_FIXED_AREA 48 // Number of lines in top fixed area (lines counted from top of screen)
      #define YMAX 320 // Bottom of screen area
      #define minimum(a,b)     (((a) < (b)) ? (a) : (b))
      #define MENU_FONT &FreeMono9pt7b // Winner
      //#define MENU_FONT &FreeMonoBold9pt7b
      //#define MENU_FONT &FreeSans9pt7b
      //#define MENU_FONT &FreeSansBold9pt7b
      #define BUTTON_SCREEN_LIMIT 12
      #define BUTTON_ARRAY_LEN BUTTON_SCREEN_LIMIT
      #define STATUS_BAR_WIDTH 16
      #define LVGL_TICK_PERIOD 6

      #define FRAME_X 100
      #define FRAME_Y 64
      #define FRAME_W 120
      #define FRAME_H 50
    
      // Red zone size
      #define REDBUTTON_X FRAME_X
      #define REDBUTTON_Y FRAME_Y
      #define REDBUTTON_W (FRAME_W/2)
      #define REDBUTTON_H FRAME_H
    
      // Green zone size
      #define GREENBUTTON_X (REDBUTTON_X + REDBUTTON_W)
      #define GREENBUTTON_Y FRAME_Y
      #define GREENBUTTON_W (FRAME_W/2)
      #define GREENBUTTON_H FRAME_H
    
      #define STATUSBAR_COLOR 0x4A49
    #endif // MARAUDER_CYD_24

    #if defined(MARAUDER_WS_C5_28)
      #define CHAN_PER_PAGE 7

      #define SCREEN_CHAR_WIDTH 40
      #define HAS_ILI9341
      #define HAS_ST7789

      // I2C bus (shared by touch CST3530, CH32V003, QMI8658, SHTC3, PCF85063A)
      #define I2C_SDA           0
      #define I2C_SCL           1
      #define I2C_FREQ          100000
      // 100 kHz (Standard-mode) 400 kHz (Fast-mode)

      #if defined(HAS_RTC) && !defined(RTC_SDA)
        #define RTC_SDA I2C_SDA
        #define RTC_SCL I2C_SCL
      #endif

      // LCD SPI
      #define TFT_SCLK          6
      #define TFT_MOSI          7
      #define TFT_MISO          8
      #define TFT_DC            9
      #define TFT_CS            10
      #define TFT_RST           -1   // CH32V003 EXIO1
      #define TFT_BL            -1   // CH32V003 PWM


      // Touch CST3530
      #define TP_SDA           I2C_SDA
      #define TP_SCL           I2C_SCL
      #define TP_INT           5
      #define TP_RST           -1   // CH32V003 EXIO0
      #define TP_FREQ          100000  // 100 kHz (Standard-mode) 400 kHz (Fast-mode)
      #define I2C_ADDR_CST3530  0x58 // NOT 0x1A : CST3530 differs from CST820

      #define BANNER_TEXT_SIZE 2

      #ifndef TFT_WIDTH
        #define TFT_WIDTH 240
      #endif

      #ifndef TFT_HEIGHT
        #define TFT_HEIGHT 320
      #endif

