evilpete/ESP32Marauder/esp32_marauder/configs.h
      #define GRAPH_VERT_LIM TFT_HEIGHT/2 - 1

      #define EXT_BUTTON_WIDTH 30

      #define SCREEN_BUFFER

      #define MAX_SCREEN_BUFFER 21

      #define SCREEN_ORIENTATION 0

      #define CHAR_WIDTH 12
      #define SCREEN_WIDTH TFT_WIDTH
      #define SCREEN_HEIGHT TFT_HEIGHT
      #define HEIGHT_1 TFT_WIDTH
      #define WIDTH_1 TFT_HEIGHT
      #define STANDARD_FONT_CHAR_LIMIT (TFT_WIDTH/6) // number of characters on a single line with normal font
      #define TEXT_HEIGHT 16 // Height of text to be printed and scrolled
      #define BOT_FIXED_AREA 0 // Number of lines in bottom fixed area (lines counted from bottom of screen)
      #define TOP_FIXED_AREA 48 // Number of lines in top fixed area (lines counted from top of screen)
      #define YMAX 320 // Bottom of screen area
      #define minimum(a,b)     (((a) < (b)) ? (a) : (b))
      //#define MENU_FONT NULL
      #define MENU_FONT &FreeMono9pt7b // Winner
      //#define MENU_FONT &FreeMonoBold9pt7b
      //#define MENU_FONT &FreeSans9pt7b
      //#define MENU_FONT &FreeSansBold9pt7b
      #define BUTTON_SCREEN_LIMIT 12
      #define BUTTON_ARRAY_LEN BUTTON_SCREEN_LIMIT
      #define STATUS_BAR_WIDTH 16
      #define LVGL_TICK_PERIOD 6

      #define FRAME_X 100
      #define FRAME_Y 64
      #define FRAME_W 120
      #define FRAME_H 50

      // Red zone size
      #define REDBUTTON_X FRAME_X
      #define REDBUTTON_Y FRAME_Y
      #define REDBUTTON_W (FRAME_W/2)
      #define REDBUTTON_H FRAME_H

      // Green zone size
      #define GREENBUTTON_X (REDBUTTON_X + REDBUTTON_W)
      #define GREENBUTTON_Y FRAME_Y
      #define GREENBUTTON_W (FRAME_W/2)
      #define GREENBUTTON_H FRAME_H

      #define STATUSBAR_COLOR 0x4A49

      #define KIT_LED_BUILTIN 13
    #endif

  #endif
  //// END DISPLAY DEFINITIONS


  //// MENU DEFINITIONS
  #ifdef MARAUDER_V4
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 120 // Centre of key
    #define KEY_Y 50
    #define KEY_W 240 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif

  #if defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 120 // Centre of key
    #define KEY_Y 50
    #define KEY_W 240 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif


  // Status bar right-side icon x-positions (SCREEN_WIDTH-relative)
  // V8 (240px): SD=170 WiFi=154 Force=138 Touch=186 Bat=204
  // Pancake (320px): SD=250 WiFi=234 Force=218 Touch=266 Bat=284
  #define SB_MEM_X    (SCREEN_WIDTH / 2 - 20)    // D%/P% text: 120 on V8, 160 on Pancake
  #define SB_SD_X     (SCREEN_WIDTH - 70)
  #define SB_WIFI_X   (SCREEN_WIDTH - 86)
  #define SB_FORCE_X  (SCREEN_WIDTH - 102)
  #define SB_TOUCH_X  (SCREEN_WIDTH - 54)
  #define SB_BAT_X    (SCREEN_WIDTH - 36)

  // Packet monitor oscilloscope geometry
  // PKT_HALF  = landscape height midpoint (zero-line y)
  // PKT_AXIS_W = x-axis draw width
  // HEIGHT_1 = TFT_WIDTH (landscape height): V8=240 Pancake=320
  // WIDTH_1  = TFT_HEIGHT (landscape width):  V8=320 Pancake=480
  #define PKT_HALF    (HEIGHT_1 / 2)
  #define PKT_AXIS_W  (WIDTH_1 - 10)
  #if defined(MARAUDER_V8)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 120 // Centre of key
    #define KEY_Y 50
    #define KEY_W 240 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif

  #if defined(MARAUDER_PANCAKE)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 160 // Centre of key
    #define KEY_Y 59
    #define KEY_W 320 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif

  #if defined(MARAUDER_CYD_MICRO)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 120 // Centre of key
    #define KEY_Y 50
    #define KEY_W 240 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif

  #if defined(MARAUDER_CYD_2USB)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 120 // Centre of key
    #define KEY_Y 50
    #define KEY_W 240 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif

  #if defined(MARAUDER_CYD_3_5_INCH)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 160 // Centre of key
    #define KEY_Y 50
    #define KEY_W 320 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif

  #if defined(MARAUDER_CYD_GUITION)
    #define BANNER_TIME 100

