evilpete/ESP32Marauder/esp32_marauder/configs.h
    #define COMMAND_PREFIX "!"
    
    // Keypad start position, key sizes and spacing
    #define KEY_X 120 // Centre of key
    #define KEY_Y 50
    #define KEY_W 240 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    // #define BUTTON_ARRAY_LEN 5
  #endif // MARAUDER_CYD_24

  #if defined(MARAUDER_WS_C5_28)
    #define BANNER_TIME 100

    #define COMMAND_PREFIX "!"

    // Keypad start position, key sizes and spacing
    #define KEY_X 160 // Centre of key
    #define KEY_Y 59
    #define KEY_W 320 // Width and height
    #define KEY_H 22
    #define KEY_SPACING_X 0 // X and Y gap
    #define KEY_SPACING_Y 1
    #define KEY_TEXTSIZE 1   // Font size multiplier
    #define ICON_W 22
    #define ICON_H 22
    #define BUTTON_PADDING 22
    //#define BUTTON_ARRAY_LEN 5
  #endif   // MARAUDER_WS_C5_28

  //// END MENU DEFINITIONS

  #if defined(HAS_SDMMC)
    #define USE_SD
    #define HAS_SD

    #ifdef MARAUDER_CYD_HMI
      #define SD_MOSI      11
      #define SD_SCK       12
      #define SD_MISO      13
      #define SD_DATA1     -1
      #define SD_DATA2     -1
      #define SD_DATA3     -1
      #define SD_MODE1BIT  true
    #endif

  #elif defined(USE_SD)

    #if defined(MARAUDER_V4) || defined(MARAUDER_V6) || defined(MARAUDER_KIT)
      #define SD_CS 12

    #elif defined(MARAUDER_V6_1)
      #define SD_CS 14

    #elif defined(MARAUDER_CYD_MICRO) || defined(MARAUDER_CYD_2USB) || defined(MARAUDER_CYD_3_5_INCH) || defined(MARAUDER_CYD_GUITION)
      #define SD_CS 5

    #elif defined(MARAUDER_MINI) || defined(MARAUDER_V7)  || defined(MARAUDER_V7_1)
      #define SD_CS 4

    #elif defined(MARAUDER_REV_FEATHER)
      #define SD_CS 10

    #elif defined(MARAUDER_M5STICKC)
      #define SD_CS -1

    #elif defined(MARAUDER_CARDPUTER) || defined(MARAUDER_CARDPUTER_ADV)
      //#define SS      12
      #define SD_CS   12
      #define SD_SCK  40
      #define SD_MISO 39
      #define SD_MOSI 14

    #elif defined(MARAUDER_FLIPPER)
      #define SD_CS 10

    #elif defined(MARAUDER_MULTIBOARD_S3)
      #define SD_CS 10

    #elif defined(ESP32_LDDB)
      #define SD_CS 4

    #elif defined(MARAUDER_DEV_BOARD_PRO)
      #define SD_CS 4

    #elif defined(XIAO_ESP32_S3)
      #define SD_CS 3

    #elif defined(MARAUDER_C5) || defined(MARAUDER_V8) || defined(MARAUDER_MINI_V3)
      #define SD_CS 10
    #elif defined(MARAUDER_T_DONGLE_C5)
      #define SD_CS 23

    #elif defined(MARAUDER_PANCAKE)
      #define SD_CS 7
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK TFT_SCLK

    #elif defined(MARAUDER_WS_C5_28)
      #define SD_SCK            6    // shared
      #define SD_MOSI           7    // shared
      #define SD_MISO           8    // dedicated MISO for SD
      #define SD_CS             23
    #endif

    #ifdef MARAUDER_JC2432W328C
      #define SD_CS 5
    #endif

    #ifdef MARAUDER_CYD_24
      #define SD_CS 5
    #endif

  #endif

  //// END SD DEFINITIONS


  //// SPACE SAVING COLORS
  #define TFTWHITE     1
  #define TFTCYAN      2
  #define TFTBLUE      3
  #define TFTRED       4
  #define TFTGREEN     5
  #define TFTGREY      6
  #define TFTGRAY      7
  #define TFTMAGENTA   8
  #define TFTVIOLET    9
  #define TFTORANGE    10
  #define TFTYELLOW    11
  #define TFTLIGHTGREY 12
  #define TFTPURPLE    13
  #define TFTNAVY      14
  #define TFTSILVER    15
  #define TFTDARKGREY  16
  #define TFTSKYBLUE   17
  #define TFTLIME      18
  #define TFTGREENYEL  19
  #define TFTDARKCYAN  20
  #define TFTPINK      21
  //// END SPACE SAVING COLORS

  #define TFT_FARTGRAY 0x528a

  //// SCREEN STUFF
  #ifndef HAS_SCREEN

    #define BANNER_TIME GRAPH_REFRESH

    #define TFT_WIDTH 0
    #define TFT_HEIGHT 0

    #define TFT_BLACK 0
    #define TFT_WHITE 0
    #define TFT_CYAN 0
    #define TFT_BLUE 0
    #define TFT_RED 0
    #define TFT_GREEN 0
    #define TFT_GREY 0
    #define TFT_GRAY 0
    #define TFT_MAGENTA 0
    #define TFT_VIOLET 0
    #define TFT_ORANGE 0
    #define TFT_YELLOW 0
    #define STANDARD_FONT_CHAR_LIMIT 40
    #define FLASH_BUTTON -1

    #define CHAN_PER_PAGE 7

    #include <FS.h>
    #include <functional>
    #include <LinkedList.h>
    #include "SPIFFS.h"
    #include "Assets.h"

  #endif
  //// END SCREEN STUFF

  //// MEMORY LOWER LIMIT STUFF
  // These values are in bytes
  #ifdef MARAUDER_M5STICKC
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CARDPUTER) || defined(MARAUDER_CARDPUTER_ADV)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_MINI)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V7)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V7_1)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_REV_FEATHER)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V4)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_MICRO)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_2USB)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_3_5_INCH)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_GUITION)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_KIT)
    #define MEM_LOWER_LIM 10000
  #elif defined(GENERIC_ESP32)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_FLIPPER)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_MULTIBOARD_S3)
    #define MEM_LOWER_LIM 10000
  #elif defined(ESP32_LDDB)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_DEV_BOARD_PRO)
    #define MEM_LOWER_LIM 10000
  #elif defined(XIAO_ESP32_S3)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_C5)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_HMI)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_T_DONGLE_C5)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_V8)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_PANCAKE)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_MINI_V3)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_JC2432W328C)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_HMI)
    #define MEM_LOWER_LIM 10000
  #elif defined(MARAUDER_CYD_24)
    #define MEM_LOWER_LIM 10000
  #else
    #define MEM_LOWER_LIM 10000
  #endif
  //// END MEMORY LOWER LIMIT STUFF

  //// NEOPIXEL STUFF
  #ifdef HAS_NEOPIXEL_LED

    #if defined(ESP32_LDDB)
      #define PIN 17
    #elif defined(MARAUDER_DEV_BOARD_PRO)
      #define PIN 16
    #elif defined(MARAUDER_REV_FEATHER)
      #define PIN 33
//    #elif defined(MARAUDER_CYD_MICRO)      // CYD have RGB leds
//      #define PIN 4
//    #elif defined(MARAUDER_CYD_2USB)
//      #define PIN 4
//    #elif defined(MARAUDER_CYD_3_5_INCH)
//      #define PIN 22
    #elif defined(MARAUDER_C5)
      #define PIN 27
    #elif defined(MARAUDER_V8)
      #define PIN 27
    #elif defined(MARAUDER_PANCAKE)
      #define PIN 27
    #elif defined(MARAUDER_CARDPUTER_ADV)
      #define PIN 21
    #elif defined(MARAUDER_M5_NANO_C6)
      #define PIN 20
    #else
      #define PIN 25
    #endif

  #endif
  //// END NEOPIXEL STUFF

  //// EVIL PORTAL STUFF

  #ifdef HAS_PSRAM
    #define MAX_HTML_SIZE 30000
  #else
    #define MAX_HTML_SIZE 11400
  #endif

  //// END EVIL PORTAL STUFF

//// GPS STUFF
  #ifdef HAS_GPS
    #ifdef HAS_PSRAM
      #define mac_history_len 500
    #else
      #define mac_history_len 100
    #endif

