evilpete/ESP32Marauder/esp32_marauder/configs.h
    #define mac_history_len_half (mac_history_len / 2)

    #if defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 4
      #define GPS_RX 13
    #elif defined(MARAUDER_CYD_MICRO)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 22 // Whoever thought it would be a good idea to use UART0 for GPS...
      #define GPS_RX 27 // Now maybe we will be able to use CLI
    #elif defined(MARAUDER_CYD_2USB)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 22 // Whoever thought it would be a good idea to use UART0 for GPS...
      #define GPS_RX 27 // Now maybe we will be able to use CLI
    #elif defined(MARAUDER_CYD_3_5_INCH)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 25
    #elif defined(MARAUDER_CYD_GUITION)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21 // Fits the extended I/O
      #define GPS_RX 22
    #elif defined(MARAUDER_V4)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 4
      #define GPS_RX 13
    #elif defined(MARAUDER_KIT)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 4
      #define GPS_RX 13
    #elif defined(MARAUDER_DEV_BOARD_PRO)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 17
    #elif defined(MARAUDER_MINI)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 22
    #elif defined(MARAUDER_V7)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 22
    #elif defined(MARAUDER_V7_1)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 22
    #elif defined(MARAUDER_FLIPPER)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 9
      #define GPS_RX 21
    #elif defined(MARAUDER_MULTIBOARD_S3)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 9
      #define GPS_RX 21
    #elif defined(MARAUDER_M5STICKC)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 33
      #define GPS_RX 32
    #elif defined(MARAUDER_CARDPUTER)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 1
      #define GPS_RX 2
    #elif defined(MARAUDER_CARDPUTER_ADV)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 15
      #define GPS_RX 13
    #elif defined(MARAUDER_REV_FEATHER)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 6
      #define GPS_RX 9
    #elif defined(MARAUDER_T_DONGLE_C5)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 12 // External GPS TX -> T-Dongle UART0 RX
      #define GPS_RX 11 // External GPS RX -> T-Dongle UART0 TX
    #elif defined(MARAUDER_C5)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #elif defined(MARAUDER_PANCAKE)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #elif defined(MARAUDER_V8)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #elif defined(MARAUDER_MINI_V3)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 14
      #define GPS_RX 13
    #elif defined(MARAUDER_CYD_24)
      #define GPS_SERIAL_INDEX 2
      #define GPS_TX 21
      #define GPS_RX 35
    #elif defined(MARAUDER_CYD_HMI)
      #define GPS_SERIAL_INDEX 1
      #define GPS_TX 15         // Gover 1
      #define GPS_RX 16
    #endif
  #else
    #define mac_history_len 100
    #define mac_history_len_half (mac_history_len / 2)
  #endif
  //// END GPS STUFF


  //// BATTERY STUFF
  #ifdef HAS_BATTERY

    #if defined(MARAUDER_M5STICKC) || defined(MARAUDER_M5STICKCP2) 
      #define I2C_SDA 21
      #define I2C_SCL 22

    #elif defined(MARAUDER_V4) || defined(MARAUDER_V6) || defined(MARAUDER_V6_1) || defined(MARAUDER_KIT)
      #define I2C_SDA 33
      #define I2C_SCL 22
      #define HAS_MAX1704X
      #undef HAS_AXP2101
      #undef HAS_IP5306

    #elif defined(MARAUDER_MINI)
      #define I2C_SDA 33
      #define I2C_SCL 26

    #elif defined(MARAUDER_V7)
      #define I2C_SDA 33
      #define I2C_SCL 16
      #define HAS_MAX1704X
      #undef HAS_AXP2101
      #undef HAS_IP5306

    #elif defined(MARAUDER_V7_1)
      #define I2C_SDA 33
      #define I2C_SCL 27
      #define HAS_MAX1704X
      #undef HAS_AXP2101
      #undef HAS_IP5306

    #elif defined(MARAUDER_CYD_MICRO) || defined(MARAUDER_CYD_2USB)
      #define I2C_SDA 22
      #define I2C_SCL 27

    #elif defined(MARAUDER_CYD_3_5_INCH)
      #define I2C_SDA 32
      #define I2C_SCL 25

    #elif defined(MARAUDER_CYD_GUITION)
      #define I2C_SDA 22
      #define I2C_SCL 21

    #elif defined(MARAUDER_V8)
      #define I2C_SCL 4
      #define I2C_SDA 5

    #elif defined(MARAUDER_REV_FEATHER)
      #define I2C_SCL 4
      #define I2C_SDA 3
      #define HAS_MAX1704X
      #undef HAS_AXP2101
      #undef HAS_IP5306

    #elif defined(MARAUDER_PANCAKE)
      #define I2C_SDA 9
      #define I2C_SCL 10
      #define HAS_MAX1704X
      // FT6336 cap touch - shares I2C bus with MAX17048
      #define TP_RST 8
      #define TP_SDA I2C_SDA
      #define TP_SCL I2C_SCL

    #elif defined(MARAUDER_WS_C5_28)    // ADC is through IO expander
      #define I2C_SDA 0
      #define I2C_SCL 1
    #endif

    #ifdef MARAUDER_CYD_HMI
      #define BATTERY_ADC_PIN 5
    #endif

    //  If we know what we have, we can delete what we're not using
    #if defined(BATTERY_ADC_PIN) || defined(HAS_CH32V003)
      #undef HAS_AXP2101
      #undef HAS_IP5306
      #undef HAS_MAX1704X
      #undef HAS_AXP192

    // No driver for this LiPo charger
    #elif defined(HAS_TP4057)
      #undef HAS_AXP2101
      #undef HAS_IP5306
      #undef HAS_MAX1704X
      #undef HAS_AXP192
      #undef HAS_BATTERY

    #elif defined(HAS_IP5306)
      #undef HAS_AXP2101
      #undef HAS_MAX1704X
      #undef HAS_AXP192

    #elif defined(HAS_AXP192)
      #undef HAS_AXP2101
      #undef HAS_IP5306
      #undef HAS_MAX1704X

    #elif defined(HAS_AXP2101)
      #undef HAS_IP5306
      #undef HAS_MAX1704X
      #undef HAS_AXP192

    #elif defined(HAS_MAX1704X)
      #undef HAS_AXP2101
      #undef HAS_IP5306
      #undef HAS_AXP192

    #else       // punt
       // #define HAS_AXP2101
       #warning "HAS_BATTERY defined without hardware type,  see 'BATTERY STUFF' section"
       #define HAS_IP5306
       #define HAS_MAX1704X
       #define HAS_AXP192
    #endif

  #endif  // END HAS_BATTERY

  //// END BATTERY STUFF

  //// MARAUDER TITLE STUFF
  #ifdef MARAUDER_V4
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V6) || defined(MARAUDER_V6_1)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_MICRO)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_2USB)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_3_5_INCH)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_GUITION)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_KIT)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_MINI)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V7)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V7_1)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_REV_FEATHER)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_CYD_HMI)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_C5)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_V8)
    #define MARAUDER_TITLE_BYTES 13578
  #elif defined(MARAUDER_MINI_V3)
    #define MARAUDER_TITLE_BYTES 13578
  #else
    #define MARAUDER_TITLE_BYTES 13578
  #endif
  //// END MARAUDER TITLE STUFF

