evilpete/ESP32Marauder/esp32_marauder/configs.h
  //// PCAP BUFFER STUFF

  #ifdef HAS_PSRAM
    #define BUF_SIZE 8 * 1024 // Had to reduce buffer size to save RAM. GG @spacehuhn
    #define SNAP_LEN 1 * 4096 // max len of each recieved packet
  //#elif !defined(HAS_ILI9341)
  //  #define BUF_SIZE 8 * 1024 // Had to reduce buffer size to save RAM. GG @spacehuhn
  //  #define SNAP_LEN 4096 // max len of each recieved packet
  #else
    #define BUF_SIZE 3 * 1024 // Had to reduce buffer size to save RAM. GG @spacehuhn
    #define SNAP_LEN 2324 // max len of each recieved packet
  #endif

  //// END PCAP BUFFER STUFF

  //// STUPID CYD STUFF
  #if defined(HAS_CYD_TOUCH) || defined(HAS_C5_SD) || defined(HAS_SEPARATE_SD)
    #ifdef MARAUDER_CYD_MICRO
      #define XPT2046_IRQ  36
      #define XPT2046_MOSI 32
      #define XPT2046_MISO 39
      #define XPT2046_CLK  25
      #define XPT2046_CS   33

      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #ifdef MARAUDER_CYD_HMI
      #define XPT2046_IRQ  9
      #define XPT2046_MOSI 3
      #define XPT2046_MISO 4
      #define XPT2046_CLK  1
      #define XPT2046_CS   2
    #endif

    #ifdef MARAUDER_CYD_2USB
      #define XPT2046_IRQ  36
      #define XPT2046_MOSI 32
      #define XPT2046_MISO 39
      #define XPT2046_CLK  25
      #define XPT2046_CS   33

      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #ifdef MARAUDER_CYD_3_5_INCH
      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #if defined(MARAUDER_C5)
      #define SD_MISO 2
      #define SD_MOSI 7
      #define SD_SCK  6
    #elif defined(MARAUDER_T_DONGLE_C5)
      #define SD_MISO 7
      #define SD_MOSI 2
      #define SD_SCK  6
    #endif

    #ifdef MARAUDER_V8
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V4
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V6
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V6_1
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_KIT
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_MINI
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_V7
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_MINI_V3
      #define SD_MISO TFT_MISO
      #define SD_MOSI TFT_MOSI
      #define SD_SCK  TFT_SCLK
    #endif

    #ifdef MARAUDER_JC2432W328C
      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18
    #endif

    #ifdef MARAUDER_CYD_HMI
      #define XPT2046_IRQ  9
      #define XPT2046_MOSI 3
      #define XPT2046_MISO 4
      #define XPT2046_CLK  1
      #define XPT2046_CS   2
    #endif

    #ifdef MARAUDER_CYD_24
      #define SD_MISO      19
      #define SD_MOSI      23
      #define SD_SCK       18

   #elif defined(MARAUDER_JC2432W328C)
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4

    #elif defined(MARAUDER_CYD_24)
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4 #endif

    #elif !defined(B_PIN) || !defined(G_PIN) || !defined(R_PIN) 
      #undef HAS_FLIPPER_LED
    #endif

  #endif

  #ifdef CYD_SOUND
    #define SOUND_PIN 26
  #endif
  //// END STUPID CYD STUFF


  //// FUNNY FLIPPER LED STUFF

  #ifdef HAS_FLIPPER_LED
    #ifdef MARAUDER_FLIPPER
      #define B_PIN 4
      #define G_PIN 5
      #define R_PIN 6
    #endif

    #ifdef MARAUDER_MULTIBOARD_S3
      #define B_PIN 4
      #define G_PIN 5
      #define R_PIN 6
    #endif

    #ifdef MARAUDER_CYD_MICRO
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

    #ifdef MARAUDER_CYD_2USB
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

    #ifdef MARAUDER_CYD_3_5_INCH
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 22
    #endif

    #ifdef MARAUDER_CYD_GUITION
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

    #if defined(MARAUDER_JC2432W328C)
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

    #if defined(MARAUDER_CYD_24)
      #define B_PIN 17
      #define G_PIN 16
      #define R_PIN 4
    #endif

  #endif
  //// END FUNNY FLIPPER LED STUFF

  #if defined(HAS_FLIPPER_LED) && (!defined(B_PIN) || !defined(G_PIN) || !defined(R_PIN) )
    #warning "HAS_FLIPPER_LED has no LED PINS defined"
    #undef HAS_FLIPPER_LED
  #endif

  #if defined(HAS_NEOPIXEL_LED) || defined(HAS_FLIPPER_LED)
    #define HAS_LED
  #endif

  #if defined(HAS_CST820) || defined(HAS_FT6336)
    #define HAS_CAP_TOUCH
  #endif

  //// WIFI STUFF

  #ifndef HAS_DUAL_BAND
    #define HOP_DELAY 1000
  #else
    #define HOP_DELAY 250
  #endif

  //// ACT LED STUFF
  #ifdef HAS_ACT_LED

    #ifdef MARAUDER_V8
      #define ACT_LED_PIN 28
    #endif

  #endif

  // CONFIG LOGIC

#pragma GCC diagnostic push
#pragma GCC diagnostic warning "-Wcpp"


  //  I2C Touch Screens
  #if defined(HAS_CST820) || defined(HAS_AXS5106L) || defined(HAS_FT6336) || defined(HAS_CST3530)
    #define HAS_CAP_TOUCH 1
  #endif

  //  define HAS_RTC if we have RTC hardware
  #if defined(HAS_PCF8523) || defined(HAS_DS1307) || defined(HAS_PCF85063) || defined(HAS_PCF8563)
    #define HAS_RTC 1
  #endif

  #if defined(HAS_NIMBLE_2) && !defined(HAS_BT)
    #warning "HAS_NIMBLE_2 defined without HAS_BT, check 'BOARD FEATURES' section"
    #define HAS_BT 1
  #endif

  #if defined(HAS_FULL_SCREEN) && !defined(HAS_SCREEN)
    #warning "HAS_FULL_SCREEN defined without HAS_SCREEN, check 'BOARD FEATURES' section"
    #define HAS_SCREEN 1
  #endif

  #if defined(HAS_MINI_SCREEN) && !defined(HAS_SCREEN)
    #warning "HAS_MINI_SCREEN defined without HAS_SCREEN, check 'BOARD FEATURES' section"
    #define HAS_SCREEN 1
  #endif

  #if defined(USE_SD) && !defined(SD_CS)
    #warning "USE_SD defined without SD_CS, check 'SD DEFINITIONS' section"
  #endif

  #if defined(HAS_C5_SD) && ( !defined(USE_SD) || !defined(HAS_SD) )
    #warning "HAS_C5_SD defined without USE_SD/HAS_SD, check 'BOARD FEATURES' section"
    #define HAS_SD
    #define USE_SD
  #endif

  #if defined(HAS_FLIPPER_LED) || defined(XIAO_ESP32_S3) || defined(HAS_XIAO_LED) \
    || defined(HAS_STICKC_LED) || defined(HAS_NEOPIXEL_LED)
      #define HAS_LED
  #endif

  #ifdef HAS_TEMP_SENSOR

    // ESP_IDF_VERSION_MAJOR ESP_ARDUINO_VERSION_MAJOR
    #if (defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)) && \
          (defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3) \
          || defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C5) \
          || defined(CONFIG_IDF_TARGET_ESP32C6) || defined(CONFIG_IDF_TARGET_ESP32H2) )
      #define HAS_CPU_TEMP
    #else
      #undef HAS_CPU_TEMP
    #endif

    //do we have a SENSOR?
    #if !( defined(USE_CPU_TEMP) || defined(HAS_SHTC3) || defined(HAS_AHT20) )
      #warning "HAS_TEMP_SENSOR set without source device HAS_SHTC3 or USE_CPU_TEMP"
      #undef HAS_TEMP_SENSOR
    #endif

  #endif   // HAS_TEMP_SENSOR

#pragma GCC diagnostic pop


  // END CONFIG LOGIC

#endif
